In [25]:
"""" 1. Write a program (use Pandas) to append a row to an existing DataFrame and display the combined data. 
Data:
ID: 1,2,3,4,5
Name: Ted, Liz, Kate, Tom
Subject: Math, Biology, Math, Chemistry
New Rows:
6 John Math
7 Robert Biology

2. Write a program to join the two dataframes. Please use left join 

 DF1:   
Data:
ID: 1,2,3,4,5
Name: Ted, Liz, Kate, Tom
Subject: Math, Biology, Math, Chemistry


DF2:   
Data:
Subject: Math, Biology,Chemistry, English
Teacher: Smith, Kelly, Edvig, Avau


"""

'" 1. Write a program (use Pandas) to append a row to an existing DataFrame and display the combined data. \nData:\nID: 1,2,3,4,5\nName: Ted, Liz, Kate, Tom\nSubject: Math, Biology, Math, Chemistry\nNew Rows:\n6 John Math\n7 Robert Biology\n\n2. Write a program to join the two dataframes. Please use left join \n\n DF1:   \nData:\nID: 1,2,3,4,5\nName: Ted, Liz, Kate, Tom\nSubject: Math, Biology, Math, Chemistry\n\n\nDF2:   \nData:\nSubject: Math, Biology,Chemistry, English\nTeacher: Smith, Kelly, Edvig, Avau\n\n\n'

In [37]:
import pandas as pd
import numpy as np

In [38]:
data = {'ID': ['1', '2', '3', '4', '5'],
        'Name': ['Ted', 'Liz', 'Kate', 'Tom', np.nan],
        'Subject' : ['Math', 'Biology', 'Math', 'Chemistry', np.nan]
        
}

In [39]:
compet = pd.DataFrame(data)

In [40]:
compet

  ID  Name    Subject
0  1   Ted       Math
1  2   Liz    Biology
2  3  Kate       Math
3  4   Tom  Chemistry
4  5   NaN        NaN

In [41]:
data2 = {
    'ID': ['6', '7'],
    'Name': ['John', 'Robert'],
    'Subject': ['Math', 'Biology']
    }
competadd = pd.DataFrame(data2)

In [42]:
competadd

  ID    Name  Subject
0  6    John     Math
1  7  Robert  Biology

In [43]:
compet.append(competadd, ignore_index=True)

/var/folders/gw/y4dl2m9n7sjgz9jqdm3ht3t80000gn/T/ipykernel_17054/2055237326.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  compet.append(competadd, ignore_index=True)

  ID    Name    Subject
0  1     Ted       Math
1  2     Liz    Biology
2  3    Kate       Math
3  4     Tom  Chemistry
4  5     NaN        NaN
5  6    John       Math
6  7  Robert    Biology

In [50]:
##Â 2

df1 = {'ID': ['1', '2', '3', '4', '5'],
        'Name': ['Ted', 'Liz', 'Kate', 'Tom', np.nan],
        'Subject' : ['Math', 'Biology', 'Math', 'Chemistry', np.nan]
        
}


df11 = pd.DataFrame(df1)
df11

  ID  Name    Subject
0  1   Ted       Math
1  2   Liz    Biology
2  3  Kate       Math
3  4   Tom  Chemistry
4  5   NaN        NaN

In [51]:
df2 = { 'Subject': ['Math', 'Biology', 'Chemistry', 'English'],
        'Teacher' : ['Smith', 'Kelly', 'Edvig', 'Avau']
        
}


df22 = pd.DataFrame(df2)
df22

     Subject Teacher
0       Math   Smith
1    Biology   Kelly
2  Chemistry   Edvig
3    English    Avau

In [52]:
pd.merge(df11,df22,how='left')

  ID  Name    Subject Teacher
0  1   Ted       Math   Smith
1  2   Liz    Biology   Kelly
2  3  Kate       Math   Smith
3  4   Tom  Chemistry   Edvig
4  5   NaN        NaN     NaN